Repository: corgibytes/freshli-cli
Catalog: Corgibytes.Freshli.Cli/Resources/CliOutput.*.resx
Languages: es

# Help_MainCommand_Description
source: Root Command
es: Comando principal

# Help_Option_CacheDir_Description
source: The location for storing temporary files
es: Directorio de almacenamiento de archivos temporales.

# Help_CacheCommand_Description
source: Manages the local cache database and directory
es: Gestión de base de datos y directorio local de cache.

# Help_CachePrepareCommand_Description
source: Ensures the cache directory exists and contains a valid cache database
es: Verifica que el directorio de cache exista y contenga una base de datos de cache válida.

# Help_CacheDestroyCommand_Description
source: Deletes the Freshli cache
es: Eliminación del directorio de cache.

# Help_CacheDestoyCommand_Option_Force
source: Don't prompt to confirm destruction of cache
es: Eliminación del directorio de cache sin preguntar por confirmación.

# Help_ScanCommand_Description
source: Returns metrics results for given local repository path
es: Devolución de resultados de las métricas de escaneo para el repositorio local indicado.

# Help_ScanCommand_Option_Format
source: Specifies how to format output. Case insensitive.
es: Indica el formato del resultado. (distingue entre mayúsculas y minúsculas.)

# Help_ScanCommand_Option_Output
source: Specifies how to output result. Case insensitive. Supports multiple values.
es: Especifica cómo mostrar el resultado. (distingue entre mayúsculas y minúsculas.) Admite múltiples valores.

# Help_ScanCommand_Argument_Path
source: Source code repository path
es: El directorio del repositorio de código fuente.

# Output_Date
source: Date (yyyy-MM-dd)
es: Fecha (aaaa-MM-dd)

# Output_LibYear
source: LibYear
es: AñoLib

# Output_Skipped
source: Skipped
es: Omitido

# Output_UpgradesAvailable
source: UpgradesAvailable
es: Existen actualizaciones disponibles.

# ScanCommand_ScanCommand_Executing_scan_command_handler
source: Executing scan command handler
es: Ejecutando el comando de escaneo.

# MainCommand_MainCommand_Root_Command_Executed
source: Root Command Executed
es: El comando principal fue ejecutado

# AuthCommand_AuthCommand_Executing_auth_command_handler
source: Executing auth command handler
es: Ejecutando el comando de autenticación.

# ScanCommandRunner_Run_Path_should_not_be_null_or_empty
source: Path should not be null or empty
es: El directorio no debe ser nulo o vacío

# CachePrepareCommandRunner_Run_Preparing_cache
source: Preparing cache at {0}.
es: Preparando el directorio de cache en {0}.

# CacheDestroyCommandRunner_Run_Prompt
source: Do you want to completely DELETE the directory {0}?
es: ¿Estas seguro de que quieres eliminar por completo el directorio de cache {0}?

# CacheDestroyCommandRunner_Run_Abort
source: Operation aborted. Cache not destroyed.
es: La operación fue cancelada. El cache no fue eliminado.

# CacheDestroyCommandRunner_Run_Destroying
source: Destroying the cache at {0}.
es: Eliminando el directorio de cache en {0}.

# Exception_Cache_Prepare_NonEmpty
source: Cannot use an existing non-empty directory as a cache directory.
es: No se puede utilizar un directorio no vacío como un directorio de cache.

# Warning_Cache_Destroy_DoesNotExist
source: Cache directory already destroyed or does not exist.
es: El directorio de cache ya fue eliminado o no existe.

# Exception_Cache_Destroy_NonCache
source: This directory is not a Freshli cache. Directory not destroyed.
es: El directorio especificado no fue eliminado ya que no es un cache de Freshli.

# Help_GitCommand_Description
source: Uses git to traverse through a repository's history
es: Gestión de repositorios clonados por Freshli

# Help_GitCloneCommand_Description
source: Clone a repository for Freshli to examine
es: Clonación del repositorio a ser examinado por Freshli

# Help_GitCloneCommand_Argument_Repo_Url
source: The URL to the repository to clone
es: La dirección URL del repositorio a clonar

# Help_GitCloneCommand_Option_Branch
source: The branch to check out on the repository
es: La rama del repositorio a analizar

# Help_GitCloneCommand_Option_Git_Path
source: The path to the Git executable to use
es: La ubicación del ejecutable de git a utilizar.

# Exception_Git_NoRepoWithHash
source: No repository with this hash exists in cache.
es: No se encontró un repositorio con el hash indicado en el cache.

# Exception_Git_EncounteredError
source: Git encountered an error:
es: Git encontró un error:

# AgentsDetectCommandRunner_Run_No_detected_agents_found
source: No detected agents found
es: No se encontró agente detectado

# ComputeLibYearCommandRunner_Run_FilePath_should_not_be_null_or_empty
source: Filepath should not be null or empty
es: Filepath no debe ser nula o vacía

# ComputeLibYearCommandRunner_Table_Header_Currently_Installed
source: Currently installed
es: Actualmente instalado

# ComputeLibYearCommandRunner_Table_Header_Latest_Available
source: Latest available
es: Último disponible

# ComputeLibYearCommandRunner_Table_Header_Package
source: Package
es: Paquete

# ComputeLibYearCommandRunner_Table_Header_Released_at
source: Released at
es: Publicado en

# ReadCycloneDxFile_Exception_Can_Not_Read_File
source: Can not read file, as no file path was given
es: No se puede leer el archivo, ya que no se proporcionó la ruta del archivo

# CachedGitSourceRepository_No_Repository_Found_In_Cache
source: No repository with this hash exists in cache.
es: No existe ningún repositorio con este hash en caché.

# GitArchive_Git_Exception
source: Git encountered an error: {0}
es: Git encontró un error: {0}

# PrepareCacheMessageHandler_Run_Preparing_cache
source: Preparing cache at {0}.
es: El archivo {0} no existe.
